synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/instance/usbc.h
#define REG_USBC_UECON7CLR         (*(WoReg  *)0x400A523CU) /**< \brief (USBC) TXINE Clear */
#define REG_USBC_UHCON             (*(RwReg  *)0x400A5400U) /**< \brief (USBC) Host General Control Register */
#define REG_USBC_UHINT             (*(RoReg  *)0x400A5404U) /**< \brief (USBC) Host Global Interrupt Register */
#define REG_USBC_UHINTCLR          (*(WoReg  *)0x400A5408U) /**< \brief (USBC) Host Global Interrrupt Clear Register */
#define REG_USBC_UHINTSET          (*(WoReg  *)0x400A540CU) /**< \brief (USBC) Host Global Interrupt Set Register */
#define REG_USBC_UHINTE            (*(RoReg  *)0x400A5410U) /**< \brief (USBC) Host Global Interrupt Enable Register */
#define REG_USBC_UHINTECLR         (*(WoReg  *)0x400A5414U) /**< \brief (USBC) Host Global Interrupt Enable Clear Register */
#define REG_USBC_UHINTESET         (*(WoReg  *)0x400A5418U) /**< \brief (USBC) Host Global Interrupt Enable Set Register */
#define REG_USBC_UPRST             (*(RwReg  *)0x400A541CU) /**< \brief (USBC) Pipe Reset Register */
#define REG_USBC_UHFNUM            (*(RwReg  *)0x400A5420U) /**< \brief (USBC) Host Frame Number Register */
#define REG_USBC_UHSOFC            (*(RwReg  *)0x400A5424U) /**< \brief (USBC) Host Start of Frame Control Register */
#define REG_USBC_UPCFG0            (*(RwReg  *)0x400A5500U) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG1            (*(RwReg  *)0x400A5504U) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG2            (*(RwReg  *)0x400A5508U) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG3            (*(RwReg  *)0x400A550CU) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG4            (*(RwReg  *)0x400A5510U) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG5            (*(RwReg  *)0x400A5514U) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG6            (*(RwReg  *)0x400A5518U) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPCFG7            (*(RwReg  *)0x400A551CU) /**< \brief (USBC) Pipe Configuration Register */
#define REG_USBC_UPSTA0            (*(RoReg  *)0x400A5530U) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA1            (*(RoReg  *)0x400A5534U) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA2            (*(RoReg  *)0x400A5538U) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA3            (*(RoReg  *)0x400A553CU) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA4            (*(RoReg  *)0x400A5540U) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA5            (*(RoReg  *)0x400A5544U) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA6            (*(RoReg  *)0x400A5548U) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA7            (*(RoReg  *)0x400A554CU) /**< \brief (USBC) Pipe Status Register */
#define REG_USBC_UPSTA0CLR         (*(WoReg  *)0x400A5560U) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA1CLR         (*(WoReg  *)0x400A5564U) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA2CLR         (*(WoReg  *)0x400A5568U) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA3CLR         (*(WoReg  *)0x400A556CU) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA4CLR         (*(WoReg  *)0x400A5570U) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA5CLR         (*(WoReg  *)0x400A5574U) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA6CLR         (*(WoReg  *)0x400A5578U) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA7CLR         (*(WoReg  *)0x400A557CU) /**< \brief (USBC) Pipe Status Clear Register */
#define REG_USBC_UPSTA0SET         (*(WoReg  *)0x400A5590U) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA1SET         (*(WoReg  *)0x400A5594U) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA2SET         (*(WoReg  *)0x400A5598U) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA3SET         (*(WoReg  *)0x400A559CU) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA4SET         (*(WoReg  *)0x400A55A0U) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA5SET         (*(WoReg  *)0x400A55A4U) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA6SET         (*(WoReg  *)0x400A55A8U) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPSTA7SET         (*(WoReg  *)0x400A55ACU) /**< \brief (USBC) Pipe Status Set Register */
#define REG_USBC_UPCON0            (*(RoReg  *)0x400A55C0U) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON1            (*(RoReg  *)0x400A55C4U) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON2            (*(RoReg  *)0x400A55C8U) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON3            (*(RoReg  *)0x400A55CCU) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON4            (*(RoReg  *)0x400A55D0U) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON5            (*(RoReg  *)0x400A55D4U) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON6            (*(RoReg  *)0x400A55D8U) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON7            (*(RoReg  *)0x400A55DCU) /**< \brief (USBC) Pipe Control Register */
#define REG_USBC_UPCON0SET         (*(WoReg  *)0x400A55F0U) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON1SET         (*(WoReg  *)0x400A55F4U) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON2SET         (*(WoReg  *)0x400A55F8U) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON3SET         (*(WoReg  *)0x400A55FCU) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON4SET         (*(WoReg  *)0x400A5600U) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON5SET         (*(WoReg  *)0x400A5604U) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON6SET         (*(WoReg  *)0x400A5608U) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON7SET         (*(WoReg  *)0x400A560CU) /**< \brief (USBC) Pipe Control Set Register */
#define REG_USBC_UPCON0CLR         (*(WoReg  *)0x400A5620U) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON1CLR         (*(WoReg  *)0x400A5624U) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON2CLR         (*(WoReg  *)0x400A5628U) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON3CLR         (*(WoReg  *)0x400A562CU) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON4CLR         (*(WoReg  *)0x400A5630U) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON5CLR         (*(WoReg  *)0x400A5634U) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON6CLR         (*(WoReg  *)0x400A5638U) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPCON7CLR         (*(WoReg  *)0x400A563CU) /**< \brief (USBC) Pipe Control Clear Register */
#define REG_USBC_UPINRQ0           (*(RwReg  *)0x400A5650U) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ1           (*(RwReg  *)0x400A5654U) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ2           (*(RwReg  *)0x400A5658U) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ3           (*(RwReg  *)0x400A565CU) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ4           (*(RwReg  *)0x400A5660U) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ5           (*(RwReg  *)0x400A5664U) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ6           (*(RwReg  *)0x400A5668U) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_UPINRQ7           (*(RwReg  *)0x400A566CU) /**< \brief (USBC) Pipe In Request */
#define REG_USBC_USBCON            (*(RwReg  *)0x400A5800U) /**< \brief (USBC) General Control Register */
#define REG_USBC_USBSTA            (*(RoReg  *)0x400A5804U) /**< \brief (USBC) General Status Register */
#define REG_USBC_USBSTACLR         (*(WoReg  *)0x400A5808U) /**< \brief (USBC) General Status Clear Register */
#define REG_USBC_USBSTASET         (*(WoReg  *)0x400A580CU) /**< \brief (USBC) General Status Set Register */
#define REG_USBC_UVERS             (*(RoReg  *)0x400A5818U) /**< \brief (USBC) IP Version Register */
#define REG_USBC_UFEATURES         (*(RoReg  *)0x400A581CU) /**< \brief (USBC) IP Features Register */
#define REG_USBC_UADDRSIZE         (*(RoReg  *)0x400A5820U) /**< \brief (USBC) IP PB address size Register */
#define REG_USBC_UNAME1            (*(RoReg  *)0x400A5824U) /**< \brief (USBC) IP Name Part One: HUSB */
#define REG_USBC_UNAME2            (*(RoReg  *)0x400A5828U) /**< \brief (USBC) IP Name Part Two: HOST */
#define REG_USBC_USBFSM            (*(RoReg  *)0x400A582CU) /**< \brief (USBC) USB internal finite state machine */
#define REG_USBC_UDESC             (*(RwReg  *)0x400A5830U) /**< \brief (USBC) Endpoint descriptor table */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ========== Instance parameters for USBC peripheral ========== */
#define USBC_EPT_NBR                7       
#define USBC_GCLK_NUM               7       
#define USBC_HOST_IMPLEMENTED       1       
#define USBC_OTG_IMPLEMENTED                
#define USBC_USB_UTMI_IMPLEMENTED           

#endif /* _SAM4L_USBC_INSTANCE_ */
